Охотники_и_рыболовы/src/Documents/УстановкаКвотНаОхотхозяйство/УстановкаКвотНаОхотхозяйство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКвотНаОхотхозяйство</name>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ОбщиеКвотыНаОхотхозяйство</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСвоим</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧужим</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/УстановкаКвотНаОхотхозяйство/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Документы.УстановкаКвотНаОхотхозяйство.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.УстановкаКвотНаОхотхозяйство.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	Ссылка 			= ПараметрыПечати.Документ;
	
	
	
Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.НомерСтроки КАК Номер,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.ВидДичи,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.КоличествоСвоим КАК Свои,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.КоличествоЧужим КАК Чужие,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.ОбщееКоличество КАК Общее,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка.СезонОхоты КАК СезонОхоты,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка.Охотхозяйство КАК Охотхозяйство
	    |ИЗ
	    |	Документ.УстановкаКвотНаОхотхозяйство.СоставДичи КАК УстановкаКвотНаОхотхозяйствоСоставДичи
	    |ГДЕ
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка В(&Ссылка)
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Номер";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Запрос.Параметры.Вставить("Охотхозяйство",Ссылка.Охотхозяйство);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОбластьКвоты			= Макет.ПолучитьОбласть("Квоты");
	ТабДок.Очистить();
	
	ОбластьКвотыДляПечати 	= МакетДляПечати.ПолучитьОбласть("Квоты");
	ТабДокДляПечати.Очистить();
	    а = 1;
		СтруктураПараметров = Новый Структура;
		Пока Выборка.Следующий() Цикл
			ОбластьКвоты.Параметры.Заполнить(Выборка);
			ОбластьКвотыДляПечати.Параметры.Заполнить(Выборка);
			
			СтруктураПараметров.Вставить("Номер" + Строка(а),а );
					
			СтруктураПараметров.Вставить("ВидДичи" + Строка(а),Выборка.ВидДичи);
			СтруктураПараметров.Вставить("Свои" + Строка(а),Выборка.Свои);
			СтруктураПараметров.Вставить("Чужие" + Строка(а),Выборка.Чужие);
			СтруктураПараметров.Вставить("Общее" + Строка(а),Выборка.Общее);
			
			а = а + 1; 	

		КонецЦикла;
		ОбластьКвоты.Параметры.Заполнить(СтруктураПараметров);
		ОбластьКвотыДляПечати.Параметры.Заполнить(СтруктураПараметров);

		
		
	ТабДок.Вывести(ОбластьКвоты);
	
	ТабДок.ПолеСверху 		= 0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьКвотыДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры
